"{\"id\":22,\"title\":\"Cat’s Tail\",\"category\":\"Test\",\"description\":\"Did you know nearly 10 percent of all of a Cat's Bones are in its Tail?\\n\",\"content\":\"<p>With their intriguing personalities and cute looks, cats have become one of the most popular choices when it comes to choosing an animal as a pet.&nbsp;Even though we see cats everywhere around us, there is very less that we actually know about them. For instance, did you know that they&nbsp;are near-sighted?</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_0_14\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_0_14_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>This sounds shocking since their night vision and peripheral vision are better than ours. Another interesting cat trivia is that they can jump up to 6 times their length! They are also known to walk like giraffes and camels.</p>\\n<p>Everyone thinks that their cat spends most of its life sleeping. Well, you might be right here as they do in fact spend 70% of their lives sleeping! Now, that comes to about 13-16 hours a day. Jealous much? How about the richest cat in the world whose owner left his 7-million-pound fortune to it? Definitely jealous now, right?</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_1_15\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_1_15_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>While all this might be extremely fascinating, today we would love to focus on the tail of the cat. Yes, the tail. Did you know that approximately 10 percent of the bones in a cat&rsquo;s body are found in the tail? It makes sense as well since their tail is the most expressive part of their anatomy.</p>\\n<p>Thanks to all the ligaments, tendons, nerves, bones, and muscles, a cat&rsquo;s tail is extremely flexible and sensitive. The tail is one of the ways for the cat to communicate with you and the other cats. So, what does it mean when a cat wags its tail at you?</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_2_29\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_2_29_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>When a cat is unsure about its surroundings, you will find it holding the tail, as if trying to tuck it under its body. On the other hand, when you see it walking with its tail straight up, it is a sign of confidence. If you find the tail to be extremely fluffed up, it may mean that the cat feels threatened. While stalking its prey, the cat holds its tail low and straight behind the body. If you find the tail being whipped or thrashed from side to side, it could be a sign of aggression or agitation. It would be better to simply leave the animal alone at that point.</p>\\n<p>So, when is you cat friendly, happy, and willing to play? If you find the tail having a curve or hook on the end (like an umbrella handle). And finally, when you see the feline wrapping its tail around your arm or leg, get ready for some affection and possible head butting!</p>\\n<p>So, the next time you are wondering what exactly is going on inside the mind of that lovely cat of yours, simply observe its tail! You will be able to interpret its body language and judge its mood!</p>\",\"featureImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/rice-water1726054439423.webp\",\"iconImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/rice-water1726054439423.webp\"}"