"{\"id\":19,\"title\":\"Right Driving-DUPLICATE\",\"category\":\"Test\",\"description\":\"Did you know almost 65 Percent of the world’s population drives on the right side of the road\\n\",\"content\":\"<p>The&nbsp;driving side&nbsp;of a road is the side where&nbsp;vehicles&nbsp;must drive. Each country defines their rules of the road. These basic rules make traffic move more easily and lowers the risk of&nbsp;collisions.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"feedInnerArticle_1774_0_14\\\" data-is-refresh=\\\"false\\\">&nbsp;</div>\\n<div id=\\\"feedInnerArticle_1774_0_14_other\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>In the past, almost everybody travelled on the left side of the road because that was the most sensible option for feudal, violent societies. Traveling on the left side was essentially a more convenient choice for most people, considering the fact that the majority of people in society are right-handed.</p>\\n<p>The trend among nations over the years has been toward driving on the right, but Britain has done its best to stave off global homogenisation. With the expansion of travel and road building in the 1800s, traffic regulations were made in every country.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"feedInnerArticle_1774_1_15\\\" data-is-refresh=\\\"false\\\">&nbsp;</div>\\n<div id=\\\"feedInnerArticle_1774_1_15_other\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>Left-hand driving was made mandatory in Britain in 1835. Countries which were part of the British Empire followed suit. This is why to this very day, India, Australasia and the former British colonies in Africa go left. An exception to the rule, however, is Egypt, which had been conquered by Napoleon before becoming a British dependency.</p>\\n<p>In the early years of English colonisation of North America, English driving customs were followed and the colonies drove on the left. After gaining independence from England, however, they were anxious to cast off all remaining links with their British colonial past and gradually changed to right-hand driving.</p>\\n<p>Incidentally, the influence of other European immigrants, especially the French, should not be underestimated. The first law requiring drivers to keep right was passed in Pennsylvania in 1792, and similar laws were passed in New York in 1804 and New Jersey in 1813.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"feedInnerArticle_1774_2_29\\\" data-is-refresh=\\\"false\\\">&nbsp;</div>\\n<div id=\\\"feedInnerArticle_1774_2_29_other\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>Approximately two thirds of the world&rsquo;s countries which is approximately 65% of the world&rsquo;s population drives on the right side of the road. Apart from Ireland, Cyprus, Malta, and the U.K., Europe generally drives on the right hand side. Even though Canada used to drive on the left, it changed the norm to the right. It was reportedly done so that the border crossings with the U.S. could become smoother.</p>\\n<p>In Europe, the remaining left-driving countries switched one by one to driving on the right. Portugal made the switch in 1928. The change took place on the same day in the whole country, including the colonies. Territories, however, which bordered other left-driving countries were exempted. That is why Goa (now part of India) and Portuguese East Africa (now Mozambique) kept the old system. East Timor, which borders left-driving Indonesia, did change to the right though, but left-hand traffic was reintroduced by the Indonesians in 1975.</p>\",\"featureImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/loofah-gui1725945010239.webp\",\"iconImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/loofah-gui1725945010239.webp\"}"