"{\"id\":26,\"title\":\"Slim Mirror\",\"category\":\"Fitness\",\"description\":\"Clothing Outlets use Mirrors to make people look good to increase Sales. Read Here\",\"content\":\"<p>By reading the description you must be shocked that how your favourite clothing brand might be fooling you to generate sales. The next time you engage in your shopping spree, be careful if you believe that everything looks good on you.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_0_14\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_0_14_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>You might be a victim of the &ldquo;Skinny Mirror&rdquo;. Here we are not trying to be a hypocrite that you are not good-looking, but it is to make you aware that some clothing stores use these mirrors to clear out stock or for generating sales. In this article, we will throw light on one step ahead which tells that this mirror has a lot to offer than just increasing sales</p>\\n<p>A new company based out of California sells mirrors with curved glass that makes people look 10 pounds thinner in appearance. The price of these mirrors may vary from $165 and $5,500 depending upon the size and raw materials used for making the frame.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_1_15\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_1_15_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>The inflation which the mirror reflects a positive self-image amongst the customers that can maximize sales. The purpose behind making these mirrors was to make people feel better about themselves and encourage body positivity. Wearing any type of clothes is a personal choice and one should not feel conscious about trying their favourite trend of outfit.</p>\\n<p>A recent survey done in Sweden&rsquo;s clothing stores states that people who used a skinny mirror in the dressing rooms were more highly satisfied with their bodies than the regular mirror. Those who used skinny mirrors in the dressing rooms were the shoppers who end up purchasing more items of clothing.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"innerarticle_2_29\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n<div id=\\\"innerarticle_2_29_other\\\" class=\\\"adsCent\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p>Belinda Jasmine is the founder of the slimming mirror who is based out of California. Her intention behind designing the mirror was not just limited to looking good in the mirror but mainly to encourage people to feel good about themselves. It tends to give people a visual gratification of a &ldquo;sleek body silhouette&rdquo; and educates your body has nothing to do with shape, size, or weight.</p>\\n<p>Curved glass mirror makes you feel good about yourself as many people have different relationships with their bodies. For increasing self-confidence, it has nothing to do with appearance, especially body weight.</p>\\n<p>Many people have a wrong notion about these mirrors, where they state that these mirrors are made to deceive them of money by making them look good. This notion harms the mirror&rsquo;s value. However, these mirrors do display their logo which is quite transparent to be seen by the customers&rsquo; eyes.</p>\\n<p>Before you venture into your next shopping spree, always feel good and positive about yourself before trying out that new jeans or any outfit that might catch your eye. Remember, it is all about Self-Love. Even a mirror is trying to teach you to keep your confidence high and wear whatever your heart wishes to.</p>\\n<p>So, what is your thought about these mirrors?</p>\",\"featureImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/slim-mirro1737012559320.octet\",\"iconImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/slim-mirro1737012559320.octet\"}"