"{\"id\":21,\"title\":\"Home-Grown Talent\",\"category\":\"Test\",\"description\":\"5 awesome Indian Artists that need to be on your Playlist!\\n\",\"content\":\"<p>We believe that music is one of the things that can help you get through tough times and can move you in ways that you didn't think were possible. You know all about the Neha Kakkars and the Badshahs of the world. Today, let's check out some of the tremendous Indian talent that has been making waves around the world!</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"feedInnerArticle_21_0_14\\\" data-is-refresh=\\\"false\\\">&nbsp;</div>\\n<div id=\\\"feedInnerArticle_21_0_14_other\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p><strong>Prateek Kuhad:</strong>&nbsp;First on our list is the supremely talented independent singer-songwriter who managed to impress Mr. Obama! His song Cold/Mess was part of Barack Obama's Favourite Music 2019 list and it made him an internationally known artist. He sings both in Hindi and English. Some of his hits include Tum Jo Paas, Tune Kaha, Kasoor, and 100 Words.</p>\\n<p><strong>Nucleya:</strong>&nbsp;Udyan Sagar (stage name Nucleya) is an Indian DJ who has made his mark internationally. An extremely respected name in the Indian electronic music scene, Nucleya co-founded the Bandish Projekt in the late 90s. His popular songs include Sargam Breaks, Folk Tronic, Scene Kya Hai, and many more.</p>\\n<p>&nbsp;</p>\\n<center>\\n<div id=\\\"feedInnerArticle_21_1_15\\\" data-is-refresh=\\\"false\\\">&nbsp;</div>\\n<div id=\\\"feedInnerArticle_21_1_15_other\\\">&nbsp;</div>\\n</center>\\n<p>&nbsp;</p>\\n<p><strong>Ritviz:</strong>&nbsp;From winning A.I.B's 2017 Bacardi House Party Sessions to contributing to Netflix's Mismatched with the song Sun Toh, Ritviz Srivastava has been a force to reckon with. What makes this electronic musician unique is the fact that he has had Hindustani classical training since the age of 6. To enjoy his music, you can listen to tracks like Udd Gaye, Yuv, Mukti, etc.</p>\\n<p><strong>Alisha Pais:</strong> If you need powerful husky vocals, then look no further than Alisha Pais, an inspiring singer-songwriter from Mumbai. She will leave you wanting for more with her mix of memorable originals and interpreted covers. To enjoy her talent, you can listen to tracks like Up, Purple Heart, Nahi Nahi, and more.</p>\\n<p>&nbsp;</p>\\n<p><strong>Neha Bhasin:</strong>&nbsp;We bet you have attended at least one wedding with a performance on songs like Chitta Kukkad, Nai Jaana, Laung Gawacha, or Madhaniya. Yes you guessed it! They all have one thing in common, Neha Bhasin! She is bringing Punjabi Folk back in the limelight and how! When it comes to the Indie Pop genre, Neha Bhasin surely ranks high.</p>\\n<p>If you found the works of these artists interesting, then do check out talents like Max Godman (Manan Gupta), Sanaya Ardeshir, Meera Shenoy, Shirley Setia, and Dhruv Visvanath.</p>\",\"featureImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/home-grown-talent1688535095251.webp\",\"iconImg\":\"https://storage.googleapis.com/thefactmagic-stg/assets/feature/home-grown-talent1688535095251.webp\"}"